{
    "releaseNotes": [
        {
            "title": "March 2025 Release",
            "version": "Version 5.0.0.0",
            "date": "March 26, 2025",
            "summary": "Here's what's new in this release:",
            "features": [
                {
                    "title": "Higher Machine Count",
                    "descriptions": "<p>We now support a higher machine count for internal users.</p>"
                },
                {
                    "title": "Table Row Expansion & Enhanced User Experience",
                    "descriptions": "<p>Users are able to navigate nested tables with an improved user experience.</p>"
                },
                {
                    "title": "Platform Upgrade",
                    "descriptions": "<p>Upgraded User Interface and infrastructure, for improved security and performance.</p>"
                },
                {
                    "title": "Fixes Provided",
                    "descriptions": "<ol type='a'><li>Resolved an issue where user groups in the Admin tab displayed negative user counts.</li><li>In the Admin page, 'Select All' checkbox for Machine Attributes and User Attributes function consistently.</li><li>Fixed an issue where assigning a large group, such as all telemetry machines, caused a bad request in the Overview, Runtime and Battery pages.</li><li>Fixed an issue where the runtime graph was not updating correctly after applying the machine filter.</li><li>Charge time precision on the Usage Page updated to display two decimal places.</li><li>Fixed an issue where the Usage and Runtime PDF reports intermittently failed to be delivered via email.</li><li>Fixed an issue where the filter window remained visible after navigating back.</li><li>Fixed an issue on mobile devices landscape mode, which prevented seamless scrolling in the Location page.</li></ol>"
                }
            ]
        },
        {
            "title": "December 2024 Release",
            "version": "Version 4.9.0.0",
            "date": "December 18, 2024",
            "summary": "Here's what's new in this release:",
            "features": [
                {
                    "title": "Maintenance Reminders now available for Lite Devices",
                    "descriptions": "<p>Now any connected machine, including those with Lite Telemetry, can send maintenance reminders when a threshold for cleaning hours is met. Users can also export a CSV report of maintenance reminders.</p>"
                },
                {
                    "title": "Release Notes viewable in the Iris portal",
                    "descriptions": "<p>When there is an update to the portal, a notification will show in the menu. Click the question mark icon to navigate to the What's New tab to view details of the release.</p>"
                },
                {
                    "title": "Alert Notification Enhancement",
                    "descriptions": "<p>Unread or new alert notifications are now indicated by a red dot for improved visibility.</p>"
                },
                {
                    "title": "Fixes Provided",
                    "descriptions": "<ol type='a'><li>We fixed an issue where some sub-groups saw a blank Battery page without data. Those users can now see their data in the Battery page.</li><li>We fixed an issue where the Cleaning Hour meter was not updating for some machines.</li></ol>"
                }
            ]
        }
    ]
}
