{
    "releaseNotes": [
        {
            "title": "Lanzamiento de marzo de 2025",
            "version": "Versión 5.0.0.0",
            "date": "26 de marzo de 2025",
            "summary": "Estas son las novedades de esta versión:",
            "features": [
                {
                    "title": "Mayor número de máquinas",
                    "descriptions": "<p>Ahora se admite un mayor número de máquinas para usuarios internos.</p>"
                },
                {
                    "title": "Expansión de filas de tabla y experiencia de usuario mejorada",
                    "descriptions": "<p>Los usuarios ahora pueden ampliar el número de elementos mostrados por página a 64. Los usuarios pueden navegar por tablas anidadas con una experiencia de usuario mejorada.</p>"
                },
                {
                    "title": "Actualización de la plataforma",
                    "descriptions": "<p>Interfaz de usuario e infraestructura mejoradas para mayor seguridad y rendimiento.</p>"
                },
                {
                    "title": "Correcciones proporcionadas",
                    "descriptions": "<ol type='a'><li>Se solucionó un problema por el cual los grupos de usuarios en la pestaña Administrador mostraban un número de usuarios negativo.</li><li>La casilla de verificación 'Seleccionar todo' para Atributos de máquina, Atributos de usuario y Características ahora funciona correctamente y ya no permanece deshabilitada de forma intermitente.</li><li>Se solucionó un problema en el que la asignación de un grupo grande, como todas las máquinas de telemetría, causaba una solicitud incorrecta en las páginas Descripción general, Tiempo de ejecución y Batería.</li><li>Se solucionó un problema que provocaba que el gráfico de autonomía no se actualizara correctamente tras aplicar el filtro de la máquina.</li><li>La precisión del tiempo de carga en la página de uso se actualizó para mostrar dos decimales.</li><li>Se solucionó un problema por el cual el correo electrónico con los informes de uso y tiempo de ejecución en PDF no se enviaba a los clientes en el entorno de producción.</li><li>Se solucionó un problema por el cual la ventana de filtro permanecía visible después de navegar por diferentes páginas.</li><li>Se solucionó un problema en el modo horizontal de los dispositivos móviles, que impedía un desplazamiento fluido en la página Ubicación.</li></ol>"
                }
            ]
        },
        {
            "title": "Lanzamiento en diciembre de 2024",
            "version": "Versión 4.9.0.0",
            "date": "18 de diciembre de 2024",
            "summary": "Estas son las novedades de esta versión:",
            "features": [
                {
                    "title": "Recordatorios de mantenimiento ahora disponibles para dispositivos Lite",
                    "descriptions": "<p>Ahora, cualquier máquina conectada, incluidas aquellas con Lite Telemetry, puede enviar recordatorios de mantenimiento cuando se alcanza un umbral de horas de limpieza. Los usuarios también pueden exportar un informe CSV de los recordatorios de mantenimiento.</p>"
                },
                {
                    "title": "Notas de la versión visibles en el portal Iris",
                    "descriptions": "<p>Cuando haya una actualización del portal, aparecerá una notificación en el menú. Haga clic en el icono del signo de interrogación para navegar a la pestaña Novedades y ver los detalles de la versión.</p>"
                },
                {
                    "title": "Mejora de la notificación de alertas",
                    "descriptions": "<p>Las notificaciones de alerta nuevas o no leídas ahora se indican con un punto rojo para mejorar la visibilidad.</p>"
                },
                {
                    "title": "Correcciones proporcionadas",
                    "descriptions": "<ol type='a'><li>Solucionamos un problema por el cual algunos subgrupos veían una página de Batería en blanco sin datos. Esos usuarios ahora pueden ver sus datos en la página Batería.</li><li>Solucionamos un problema en el que el medidor de horas de limpieza no se actualizaba para algunas máquinas</li></ol>"
                }
            ]
        }
    ]
}
