{
    "releaseNotes": [
        {
            "title": "Sortie de mars 2025",
            "version": "Version 5.0.0.0",
            "date": "26 mars 2025",
            "summary": "Voici les nouveautés de cette version :",
            "features": [
                {
                    "title": "Nombre de machines plus élevé",
                    "descriptions": "<p>Nous prenons désormais en charge un nombre de machines plus élevé pour les utilisateurs internes.</p>"
                },
                {
                    "title": "Extension des lignes de tableau et expérience utilisateur améliorée",
                    "descriptions": "<p>Les utilisateurs peuvent désormais augmenter le nombre d'éléments affichés par page à 64. L'expérience utilisateur est améliorée grâce à la navigation dans les tableaux imbriqués.</p>"
                },
                {
                    "title": "Mise à niveau de la plateforme",
                    "descriptions": "<p>Interface utilisateur et infrastructure améliorées pour une sécurité et des performances accrues.</p>"
                },
                {
                    "title": "Correctifs fournis",
                    "descriptions": "<ol type='a'><li>Résolution d’un problème où les groupes d’utilisateurs dans l’onglet Admin affichaient des nombres d’utilisateurs négatifs.</li><li>La case à cocher « Sélectionner tout » pour les attributs de la machine, les attributs utilisateur et les fonctionnalités fonctionne désormais correctement et ne reste plus désactivée par intermittence.</li><li>Correction d'un problème où l'attribution d'un grand groupe, tel que toutes les machines de télémétrie, provoquait une mauvaise demande dans les pages Présentation, Durée d'exécution et Batterie.</li><li>Correction d'un problème où le graphique d'exécution ne se mettait pas à jour correctement après l'application du filtre de machine.</li><li>La précision du temps de charge sur la page d'utilisation a été mise à jour pour afficher deux décimales.</li><li>Correction d'un problème où l'e-mail contenant les rapports PDF d'utilisation et d'exécution ne parvenait pas à être envoyé aux clients dans l'environnement de production.</li><li>Correction d'un problème où la fenêtre de filtre restait visible après avoir navigué sur différentes pages.</li><li>Correction d'un problème sur les appareils mobiles en mode paysage, qui empêchait le défilement transparent dans la page de localisation.</li></ol>"
                }
            ]
        },
        {
            "title": "Sortie en Décembre 2024",
            "version": "Version 4.9.0.0",
            "date": "18 Décembre 2024",
            "summary": "Voici les nouveautés de cette version :",
            "features": [
                {
                    "title": "Rappels de maintenance désormais disponibles pour les appareils Lite",
                    "descriptions": "<p>Désormais, n'importe quelle machine connectée, y compris celles dotées de la télémétrie Lite, peut envoyer des rappels de maintenance lorsqu'un seuil d'heures de nettoyage est atteint. Les utilisateurs peuvent également exporter un rapport CSV des rappels de maintenance.</p>"
                },
                {
                    "title": "Notes de publication consultables sur le portail Iris",
                    "descriptions": "<p>Lorsqu'une mise à jour est disponible sur le portail, une notification s'affiche dans le menu. Cliquez sur l'icône en forme de point d'interrogation pour accéder à l'onglet Nouveautés et afficher les détails de la version.</p>"
                },
                {
                    "title": "Amélioration des notifications d'alertes",
                    "descriptions": "<p>Les notifications d'alerte non lues ou nouvelles sont désormais indiquées par un point rouge pour une meilleure visibilité.</p>"
                },
                {
                    "title": "Correctifs fournis",
                    "descriptions": "<ol type='a'><li>Nous avons résolu un problème où certains sous-groupes voyaient une page de batterie vierge sans données. Ces utilisateurs peuvent désormais voir leurs données sur la page Batterie.</li><li>Nous avons résolu un problème où le compteur d'heures de nettoyage ne se mettait pas à jour pour certaines machines.</li></ol>"
                }
            ]
        }
    ]
}
