{
    "releaseNotes": [
        {
            "title": "Sortie de mars 2025",
            "version": "Version 5.0",
            "date": "26 mars 2025",
            "summary": "Voici les nouveautés de cette version :",
            "features": [
                {
                    "title": "Nombre de machines plus élevé",
                    "descriptions": "<p>Nous prenons désormais en charge un nombre de machines plus élevé, 15 000, pour les utilisateurs internes.</p>"
                },
                {
                    "title": "Extension des lignes de tableau et expérience utilisateur améliorée",
                    "descriptions": "<p>Les utilisateurs peuvent désormais augmenter le nombre d'éléments affichés par page à 64. Ils peuvent naviguer dans les tableaux imbriqués avec une expérience utilisateur améliorée.</p>"
                },
                {
                    "title": "Mise à niveau de la plateforme",
                    "descriptions": "<p>Interface utilisateur et infrastructure mises à niveau pour une sécurité et des performances accrues.</p>"
                },
                {
                    "title": "Correctifs fournis",
                    "descriptions": "<ol type='a'><li>Correction d'un problème où les groupes d'utilisateurs de l'onglet Administration affichaient des nombres d'utilisateurs négatifs.</li><li>Dans la page Administration, la case « Tout sélectionner » pour les attributs machine et utilisateur fonctionne de manière cohérente.</li><li>Correction de problèmes où l'affectation d'un grand groupe, comme toutes les machines de télémétrie, provoquait une requête erronée dans les pages Aperçu, Autonomie et Batterie.</li><li>Correction d'un problème où le graphique d'autonomie ne se mettait pas à jour correctement après l'application du filtre machine.</li><li>La précision du temps de charge sur la page d'utilisation a été mise à jour pour afficher deux décimales.</li><li>Correction d'un problème où les rapports PDF d'utilisation et d'exécution n'étaient pas envoyés par e-mail par intermittence.</li><li>Correction d'un problème où la fenêtre de filtre restait visible après un retour en arrière.</li><li>Correction d'un problème sur les appareils mobiles en mode paysage, qui empêchait le défilement fluide de la page Emplacement.</li></ol>"
                }
            ]
        },
        {
            "title": "Sortie en Décembre 2024",
            "version": "Version 4.9.0.0",
            "date": "18 Décembre 2024",
            "summary": "Voici les nouveautés de cette version :",
            "features": [
                {
                    "title": "Rappels de maintenance désormais disponibles pour les appareils Lite",
                    "descriptions": "<p>Désormais, n'importe quelle machine connectée, y compris celles dotées de la télémétrie Lite, peut envoyer des rappels de maintenance lorsqu'un seuil d'heures de nettoyage est atteint. Les utilisateurs peuvent également exporter un rapport CSV des rappels de maintenance.</p>"
                },
                {
                    "title": "Notes de publication consultables sur le portail Iris",
                    "descriptions": "<p>Lorsqu'une mise à jour est disponible sur le portail, une notification s'affiche dans le menu. Cliquez sur l'icône en forme de point d'interrogation pour accéder à l'onglet Nouveautés et afficher les détails de la version.</p>"
                },
                {
                    "title": "Amélioration des notifications d'alertes",
                    "descriptions": "<p>Les notifications d'alerte non lues ou nouvelles sont désormais indiquées par un point rouge pour une meilleure visibilité.</p>"
                },
                {
                    "title": "Correctifs fournis",
                    "descriptions": "<ol type='a'><li>Nous avons résolu un problème où certains sous-groupes voyaient une page de batterie vierge sans données. Ces utilisateurs peuvent désormais voir leurs données sur la page Batterie.</li><li>Nous avons résolu un problème où le compteur d'heures de nettoyage ne se mettait pas à jour pour certaines machines.</li></ol>"
                }
            ]
        }
    ]
}
